Controls whether the hanger's rod's will be automatically hosted by other elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public bool CanRodsBeHosted { get; set; }
  Visual Basic
Public Property CanRodsBeHosted As Boolean
	Get
	Set
  Visual C++
public:
property bool CanRodsBeHosted {
	bool get ();
	void set (bool value);
}
 See Also
  FabricationRodInfo Class
  Autodesk.Revit.DB Namespace